<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="AdfsName">Active Directory Federation Services</string>
      <string id="DisallowFederationService">Turn off Federation Service</string>
      <string id="DisallowFederationServiceExplain">This policy setting prevents a Federation Service in Active Directory Federation Services (AD FS) from being installed or run.

If you enable this policy setting, installation of a Federation Service fails. If a Federation Service has already been installed, all requests made to it fail.

If you disable or do not configure this policy setting, installation of a Federation Service is allowed and any installed Federation Service functions normally.

Note: A Federation Service may be installed only on Windows Server 2008 Enterprise Edition or Windows Server 2008 Datacenter Edition.
</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
