<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Windows Ink Workspace</displayName>
  <description>Windows Ink Workspace</description>
  <resources>
    <stringTable>
      <string id="Handwriting">Handwriting</string>
      <string id="PanelDefaultModeDocked">Handwriting Panel Default Mode Docked</string>
      <string id="PanelDefaultModeDocked_Help">The handwriting panel has 2 modes - floats near the text box, or, attached to the bottom of the screen. Default is floating near text box. If you want the panel to be fixed, use this policy to fix it to the bottom.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
