<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns=
   "http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions"
   revision="1.0" schemaVersion="1.0">
  <displayName>Safer-Networking Ltd. software policies base file</displayName>
  <description>This file contains the Safer-Networking Ltd. software policies parent category.</description>
  <resources>
    <stringTable>
      <string id="SaferNetworking_Ltd">Safer-Networking Ltd.</string>
      <string id="SaferNetworking_Ltd_Help">Contains Safer-Networking Ltd. software specific configuration settings.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>