<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema"
   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
   xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions"
   revision="1.3" schemaVersion="1.0">
  <displayName>Spybot Anti-Beacon immunizer policies file</displayName>
  <description>This file contains the Spybot Anti-Beacon immunizer specific policies.</description>
  <resources>
    <stringTable>
      <string id="Immunisation">Immunisation</string>
      <string id="Immunisation_Help">Contains Spybot Anti-Becan software specific settings for the different immunization types.</string>
      <string id="Disable_SpybotAntiBeacon_Acer-User-Experience-Improvement-Program-Scheduled-Task">Skip Acer User Experience Improvement Program</string>
      <string id="Disable_SpybotAntiBeacon_Acer-User-Experience-Improvement-Program-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryIPImmunization">Skip Bing IPs</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryIPImmunization_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Google-Chrome-Telemetry-Group-Policy">Skip Google Chrome Telemetry</string>
      <string id="Disable_SpybotAntiBeacon_Google-Chrome-Telemetry-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_HP-CEEment-Scheduled-Task">Skip HP CEEment</string>
      <string id="Disable_SpybotAntiBeacon_HP-CEEment-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_HP-Touch-Point-Analytics-System-Service">Skip HP Touch Point Analytics</string>
      <string id="Disable_SpybotAntiBeacon_HP-Touch-Point-Analytics-System-Service_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Lenovo-Customer-Feedback-Program-Scheduled-Task">Skip Lenovo Customer Feedback Program</string>
      <string id="Disable_SpybotAntiBeacon_Lenovo-Customer-Feedback-Program-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Lenovo-Experience-Improvement-Scheduled-Task">Skip Lenovo Experience Improvement</string>
      <string id="Disable_SpybotAntiBeacon_Lenovo-Experience-Improvement-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_LibreOffice-Telemetry">Skip LibreOffice Telemetry</string>
      <string id="Disable_SpybotAntiBeacon_LibreOffice-Telemetry_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Biometrics-Group-Policy">Skip Microsoft Biometrics</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Biometrics-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Clipboard-Sharing">Skip Microsoft Clipboard Cloud Sharing</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Clipboard-Sharing_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Cortana-Group-Policy">Skip Microsoft Cortana</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Cortana-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Cortana-Restrictions">Skip Microsoft Cortana Restrictions</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Cortana-Restrictions_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Edge-DoNotTrack-Group-Policy">Skip Microsoft Edge Do-Not-Track</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Edge-DoNotTrack-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Edge-Telemetry">Skip Microsoft Edge Telemetry</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Edge-Telemetry_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Map-AutoUpdate">Skip Microsoft Map Auto-Update</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Map-AutoUpdate_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-15-2013-Group-Policy">Skip Microsoft Office 15 (2013) (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-15-2013-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-15-2013-Scheduled-Task">Skip Microsoft Office 15 (2013) (via Scheduled Task)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-15-2013-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-16-2016-Group-Policy">Skip Microsoft Office 16 (2016) (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-16-2016-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-16-2016-Scheduled-Task">Skip Microsoft Office 16 (2016) (via Scheduled Task)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-16-2016-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-17-2019-Group-Policy">Skip Microsoft Office 17 (2019) (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-17-2019-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-Telemetry-Group-Policy">Skip Microsoft Office Telemetry</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Office-Telemetry-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-OneDrive-Group-Policy">Skip Microsoft OneDrive (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-OneDrive-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-OneDrive-System-Service">Skip Microsoft OneDrive (via System Service)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-OneDrive-System-Service_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Mozilla-Firefox-Config-Telemetry">Skip Mozilla Firefox Telemetry (via Configuration)</string>
      <string id="Disable_SpybotAntiBeacon_Mozilla-Firefox-Config-Telemetry_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Mozilla-Firefox-Policy-Telemetry">Skip Mozilla Firefox Telemetry (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Mozilla-Firefox-Policy-Telemetry_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_TRedShellHostsImmunization">Skip RedShell</string>
      <string id="Disable_SpybotAntiBeacon_TRedShellHostsImmunization_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryHostsImmunization">Skip Telemetry Hosts</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryHostsImmunization_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryHostsOptionalImmunization">Skip Telemetry Hosts (extensive list)</string>
      <string id="Disable_SpybotAntiBeacon_TWindows10TelemetryHostsOptionalImmunization_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Account-Location-Services">Skip Windows Account Location</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Account-Location-Services_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Compatibility-Program-Inventory-Group-Policy">Skip Windows Application Compatibility Program Inventory</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Compatibility-Program-Inventory-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Impact-Telemetry-Group-Policy">Skip Windows Application Impact Telemetry (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Impact-Telemetry-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Impact-Telemetry-Scheduled-Task">Skip Windows Application Impact Telemetry (via Scheduled Task)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-AIT-Application-Impact-Telemetry-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Consumer-Features">Skip Windows Application Suggestions and Auto-Installation</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Consumer-Features_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Background-Access-Applications">Skip Windows Background Access Applications</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Background-Access-Applications_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-CEIP-Coustomer-Experience-Improvement-Program-Group-Policy">Skip Windows Customer Experience Improvement Program (CEIP) (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-CEIP-Coustomer-Experience-Improvement-Program-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-CEIP-Coustomer-Experience-Improvement-Program-Scheduled-Task">Skip Windows Customer Experience Improvement Program (CEIP) (via Scheduled Task)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-CEIP-Coustomer-Experience-Improvement-Program-Scheduled-Task_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Device-Location-Services">Skip Windows Device Location</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Device-Location-Services_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Error-Reporting">Skip Windows Error Reporting</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Error-Reporting_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Feedback-Firewall">Skip Windows Feedback (via Firewall)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Feedback-Firewall_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Feedback-Group-Policy">Skip Windows Feedback (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Feedback-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Handwriting-Group-Policy">Skip Windows Handwriting Data Sharing</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Handwriting-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Location-Group-Policy">Skip Windows Location</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Location-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Lockscreen-Camera-Group-Policy">Skip Windows Lock Screen Camera</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Lockscreen-Camera-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Advertising-ID-Group-Policy">Skip Windows Personalized Ads</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Advertising-ID-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Remote-Registry">Skip Windows Remote Registry</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Remote-Registry_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Sensors-Group-Policy">Skip Windows Sensors Telemetry</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Sensors-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Steps-Recorder-Group-Policy">Skip Windows Steps Recorder</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Steps-Recorder-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Tailored-Experience-Group-Policy">Skip Windows Tailored Experience</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Tailored-Experience-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-Firewall">Skip Windows Telemetry (via Firewall)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-Firewall_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-Group-Policy">Skip Windows Telemetry (via Group Policy)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-System-Service">Skip Windows Telemetry (via System Service)</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Telemetry-System-Service_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Updates-P2P">Skip Windows Update Bandwith Sharing</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Updates-P2P_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-User-Activities-Group-Policy">Skip Windows User Activities</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-User-Activities-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Web-Search-Group-Policy">Skip Windows Web Search</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-Web-Search-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-WiFi-Sense-HotSpot-Sharing-Group-Policy">Skip Windows Wi-Fi Sense Hotspot Sharing</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-WiFi-Sense-HotSpot-Sharing-Group-Policy_Help">If enabled, this setting skips the said immunization on all actions.</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-UPNP-Device-Sharing">Skip Windows Wireless Device Sharing and Syncing</string>
      <string id="Disable_SpybotAntiBeacon_Microsoft-Windows-UPNP-Device-Sharing_Help">If enabled, this setting skips the said immunization on all actions.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
