<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
<displayName>Storage Health</displayName>
<description>ADMX file for Storage Health</description>
<resources>
    <stringTable>
    <string id="StorageHealth">Storage Health</string>
    <string id="SH_AllowDiskHealthModelUpdates">Allow downloading updates to the Disk Failure Prediction Model</string>
    <string id="SH_AllowDiskHealthModelUpdates_Explain">
        Allows downloading new updates to ML Model parameters for predicting storage disk failure.

        Enabled:
        Updates would be downloaded for the Disk Failure Prediction Failure Model.

        Disabled:
        Updates would not be downloaded for the Disk Failure Prediction Failure Model.

        Not configured:
        Same as Enabled.
    </string>
    </stringTable>
</resources>
</policyDefinitionResources>
