<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   revision="1.2" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="Agent" namespace="Microsoft.Policies.FileShareShadowCopy.Agent" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
    <using prefix="products" namespace="Microsoft.Policies.Products" /> 
  </policyNamespaces>
  <resources minRequiredRevision="1.2" />

  <categories>
    <category name="Cat_FileShareShadowCopyAgent" displayName="$(string.Cat_FileShareShadowCopyAgent)">
      <parentCategory ref="windows:System" />
    </category>
  </categories>  

  <policies>
    <policy name="Pol_MaximumAge" class="Machine" displayName="$(string.Pol_MaximumAge)" explainText="$(string.Pol_MaximumAge_Help)" 
    presentation="$(presentation.Pol_MaximumAge)" key="Software\Policies\Microsoft\Windows\fssAgent">
      <parentCategory ref="Cat_FileShareShadowCopyAgent" />
      <supportedOn ref="windows:SUPPORTED_Windows8" />
      <elements>
        <decimal id="Lbl_MaximumShadowCopyAgeInHours" valueName="MaximumShadowCopyAgeInHours" minValue="1" maxValue="100000000" />
      </elements>
    </policy>    
  </policies>
</policyDefinitions>
