<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions" >

	<policyNamespaces >
		<target prefix="pcoip" namespace="VMware.Policies.pcoip" />
	</policyNamespaces>
	<supersededAdm fileName="pcoip.adm" />
	<resources minRequiredRevision="1.0" fallbackCulture="en-us" />
	<supportedOn >
		<definitions >
			<definition name="SupportedOn_1" displayName="$(string.String_SupportedOn_Undefined_2)" />
			<definition name="SupportedOn_3" displayName="$(string.String_SupportedOn_Undefined_4)" />
			<definition name="SupportedOn_5" displayName="$(string.String_SupportedOn_Undefined_6)" />
			<definition name="SupportedOn_7" displayName="$(string.String_SupportedOn_Undefined_8)" />
			<definition name="SupportedOn_9" displayName="$(string.String_SupportedOn_Undefined_10)" />
			<definition name="SupportedOn_11" displayName="$(string.String_SupportedOn_Undefined_12)" />
			<definition name="SupportedOn_13" displayName="$(string.String_SupportedOn_Undefined_14)" />
			<definition name="SupportedOn_15" displayName="$(string.String_SupportedOn_Undefined_16)" />
			<definition name="SupportedOn_17" displayName="$(string.String_SupportedOn_Undefined_18)" />
			<definition name="SupportedOn_19" displayName="$(string.String_SupportedOn_Undefined_20)" />
			<definition name="SupportedOn_20" displayName="$(string.String_SupportedOn_Undefined_21)" />
			<definition name="SupportedOn_21" displayName="$(string.String_SupportedOn_Undefined_22)" />
			<definition name="SupportedOn_23" displayName="$(string.String_SupportedOn_Undefined_24)" />
			<definition name="SupportedOn_25" displayName="$(string.String_SupportedOn_Undefined_26)" />
			<definition name="SupportedOn_27" displayName="$(string.String_SupportedOn_Undefined_28)" />
			<definition name="SupportedOn_29" displayName="$(string.String_SupportedOn_Undefined_30)" />
			<definition name="SupportedOn_31" displayName="$(string.String_SupportedOn_Undefined_32)" />
			<definition name="SupportedOn_33" displayName="$(string.String_SupportedOn_Undefined_34)" />
			<definition name="SupportedOn_35" displayName="$(string.String_SupportedOn_Undefined_36)" />
			<definition name="SupportedOn_37" displayName="$(string.String_SupportedOn_Undefined_38)" />
			<definition name="SupportedOn_39" displayName="$(string.String_SupportedOn_Undefined_40)" />
			<definition name="SupportedOn_41" displayName="$(string.String_SupportedOn_Undefined_42)" />
			<definition name="SupportedOn_43" displayName="$(string.String_SupportedOn_Undefined_44)" />
			<definition name="SupportedOn_45" displayName="$(string.String_SupportedOn_Undefined_46)" />
			<definition name="SupportedOn_47" displayName="$(string.String_SupportedOn_Undefined_48)" />
			<definition name="SupportedOn_49" displayName="$(string.String_SupportedOn_Undefined_50)" />
			<definition name="SupportedOn_51" displayName="$(string.String_SupportedOn_Undefined_52)" />
			<definition name="SupportedOn_53" displayName="$(string.String_SupportedOn_Undefined_54)" />
			<definition name="SupportedOn_55" displayName="$(string.String_SupportedOn_Undefined_56)" />
			<definition name="SupportedOn_57" displayName="$(string.String_SupportedOn_Undefined_58)" />
			<definition name="SupportedOn_59" displayName="$(string.String_SupportedOn_Undefined_60)" />
			<definition name="SupportedOn_61" displayName="$(string.String_SupportedOn_Undefined_62)" />
			<definition name="SupportedOn_63" displayName="$(string.String_SupportedOn_Undefined_64)" />
			<definition name="SupportedOn_65" displayName="$(string.String_SupportedOn_Undefined_66)" />
			<definition name="SupportedOn_67" displayName="$(string.String_SupportedOn_Undefined_68)" />
			<definition name="SupportedOn_69" displayName="$(string.String_SupportedOn_Undefined_70)" />
			<definition name="SupportedOn_71" displayName="$(string.String_SupportedOn_Undefined_72)" />
			<definition name="SupportedOn_73" displayName="$(string.String_SupportedOn_Undefined_74)" />
			<definition name="SupportedOn_75" displayName="$(string.String_SupportedOn_Undefined_76)" />
			<definition name="SupportedOn_77" displayName="$(string.String_SupportedOn_Undefined_78)" />
			<definition name="SupportedOn_79" displayName="$(string.String_SupportedOn_Undefined_80)" />
			<definition name="SupportedOn_81" displayName="$(string.String_SupportedOn_Undefined_82)" />
			<definition name="SupportedOn_83" displayName="$(string.String_SupportedOn_Undefined_84)" />
			<definition name="SupportedOn_85" displayName="$(string.String_SupportedOn_Undefined_86)" />
			<definition name="SupportedOn_87" displayName="$(string.String_SupportedOn_Undefined_88)" />
			<definition name="SupportedOn_89" displayName="$(string.String_SupportedOn_Undefined_90)" />
			<definition name="SupportedOn_91" displayName="$(string.String_SupportedOn_Undefined_92)" />
			<definition name="SupportedOn_93" displayName="$(string.String_SupportedOn_Undefined_94)" />
			<definition name="SupportedOn_95" displayName="$(string.String_SupportedOn_Undefined_96)" />
			<definition name="SupportedOn_96" displayName="$(string.String_SupportedOn_Undefined_97)" />
			<definition name="SupportedOn_97" displayName="$(string.String_SupportedOn_Undefined_98)" />
			<definition name="SupportedOn_99" displayName="$(string.String_SupportedOn_Undefined_100)" />
			<definition name="SupportedOn_101" displayName="$(string.String_SupportedOn_Undefined_102)" />
			<definition name="SupportedOn_103" displayName="$(string.String_SupportedOn_Undefined_104)" />
			<definition name="SupportedOn_105" displayName="$(string.String_SupportedOn_Undefined_106)" />
			<definition name="SupportedOn_107" displayName="$(string.String_SupportedOn_Undefined_108)" />
			<definition name="SupportedOn_109" displayName="$(string.String_SupportedOn_Undefined_110)" />
			<definition name="SupportedOn_111" displayName="$(string.String_SupportedOn_Undefined_112)" />
			<definition name="SupportedOn_113" displayName="$(string.String_SupportedOn_Undefined_114)" />
			<definition name="SupportedOn_115" displayName="$(string.String_SupportedOn_Undefined_116)" />
			<definition name="SupportedOn_117" displayName="$(string.String_SupportedOn_Undefined_118)" />
			<definition name="SupportedOn_119" displayName="$(string.String_SupportedOn_Undefined_120)" />
			<definition name="SupportedOn_121" displayName="$(string.String_SupportedOn_Undefined_122)" />
			<definition name="SupportedOn_123" displayName="$(string.String_SupportedOn_Undefined_124)" />
			<definition name="SupportedOn_125" displayName="$(string.String_SupportedOn_Undefined_126)" />
			<definition name="SupportedOn_127" displayName="$(string.String_SupportedOn_Undefined_128)" />
			<definition name="SupportedOn_129" displayName="$(string.String_SupportedOn_Undefined_130)" />
			<definition name="SupportedOn_131" displayName="$(string.String_SupportedOn_Undefined_132)" />
			<definition name="SupportedOn_133" displayName="$(string.String_SupportedOn_Undefined_134)" />
			<definition name="SupportedOn_135" displayName="$(string.String_SupportedOn_Undefined_136)" />
			<definition name="SupportedOn_137" displayName="$(string.String_SupportedOn_Undefined_138)" />
			<definition name="SupportedOn_139" displayName="$(string.String_SupportedOn_Undefined_140)" />
			<definition name="SupportedOn_141" displayName="$(string.String_SupportedOn_Undefined_142)" />
			<definition name="SupportedOn_143" displayName="$(string.String_SupportedOn_Undefined_144)" />
			<definition name="SupportedOn_145" displayName="$(string.String_SupportedOn_Undefined_146)" />
			<definition name="SupportedOn_147" displayName="$(string.String_SupportedOn_Undefined_148)" />
			<definition name="SupportedOn_149" displayName="$(string.String_SupportedOn_Undefined_150)" />
			<definition name="SupportedOn_151" displayName="$(string.String_SupportedOn_Undefined_152)" />
		</definitions>
	</supportedOn>
	<categories ><!--Storage for Category Definitions-->

		<category name="Cat_PCoIP_Session_Variables_153" displayName="$(string.String_Cat_PCoIP_Session_Variables_154)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" />
		<category name="Cat_Not_Overridable_155" displayName="$(string.String_Cat_Not_Overridable_156)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" >
			<parentCategory ref="Cat_PCoIP_Session_Variables_153" />
		</category>
		<category name="Cat_Overridable_Administrator_157" displayName="$(string.String_Cat_Overridable_Administrator_158)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" >
			<parentCategory ref="Cat_PCoIP_Session_Variables_153" />
		</category>
	</categories>
	<policies ><!--Storage for Policy Definitions-->

		<policy name="Policy_Turn_off_Build_to_Lossles_159" class="Machine" displayName="$(string.String_Policy_Turn_off_Build_to_Lossles_160)" explainText="$(string.String_Explain_Specifies_whether_161)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_build_to_lossless" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_1" />
			<enabledValue >
				<decimal value="0" />
			</enabledValue>
			<disabledValue >
				<decimal value="1" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_maximum_162" class="Machine" displayName="$(string.String_Policy_Configure_the_maximum_163)" explainText="$(string.String_Explain_Specifies_the_maximum_164)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_maximum_162)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_3" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_maximum_165" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.max_link_rate" required="true" maxValue="900000" minValue="104" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_166" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_167)" explainText="$(string.String_Explain_Specifies_the_Maximum_168)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_PCoIP_166)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_5" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_169" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.mtu_size" required="true" maxValue="1500" minValue="500" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_170" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_171)" explainText="$(string.String_Explain_Specifies_a_lower_172)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_PCoIP_170)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_7" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_173" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.device_bandwidth_floor" required="true" maxValue="100000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Enable_disable_174" class="Machine" displayName="$(string.String_Policy_Enable_disable_175)" explainText="$(string.String_Explain_Determines_whether_176)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_audio" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_9" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Enable_disable_177" class="Machine" displayName="$(string.String_Policy_Enable_disable_178)" explainText="$(string.String_Explain_Determines_whether_179)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_micin_noise_filter" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_11" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_180" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_181)" explainText="$(string.String_Explain_Specifies_the_maximum_182)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_PCoIP_180)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_13" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_183" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.audio_bandwidth_limit" required="true" maxValue="100000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_connections_184" class="Machine" displayName="$(string.String_Policy_Configure_SSL_connections_185)" explainText="$(string.String_Explain_Specifies_how_SSL_186)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_SSL_connections_184)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_15" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_187" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ssl_cert_deny_legacy_connections" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
				<enum id="Policy_DropList_Element_Configure_SSL_connections_188" valueName="pcoip.ssl_cert_type" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_From_the_Certificate_189)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_Generate_a_unique_190)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_From_the_Certificate_191)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_SSL_connections_192" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.cert_store_name" maxLength="255" />
				<enum id="Policy_DropList_Element_Configure_SSL_connections_193" valueName="pcoip.ssl_cert_min_key_length" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_1024_194)" >
						<value >
							<decimal value="1024" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_2048_195)" >
						<value >
							<decimal value="2048" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_4096_196)" >
						<value >
							<decimal value="4096" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_SSL_connections_197" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ca_cert_store_name" maxLength="255" />
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_198" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ask_clients_to_use_vcs_sni" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_199" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ssl_disable_aes_128" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_200" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_201)" explainText="$(string.String_Explain_Controls_the_encryption_202)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_200)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_17" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_203" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_salsa20_256_round12" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_204" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_aes_128_gcm" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_205" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_aes_256_gcm" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_protocols_206" class="Machine" displayName="$(string.String_Policy_Configure_SSL_protocols_207)" explainText="$(string.String_Explain_Configures_openssl_208)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_SSL_protocols_206)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_19" />
			<elements >
				<text id="Policy_TextBox_Element_Configure_SSL_protocols_209" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ssl_protocol" />
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_cipher_list_207" class="Machine" displayName="$(string.String_Policy_Configure_SSL_cipher_list_209)" explainText="$(string.String_Explain_Configures_SSL_cipher_list_210)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_SSL_cipher_list_207)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_20" />
			<elements >
				<text id="Policy_TextBox_Element_Configure_SSL_cipher_list_210" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.ssl_cipher_list" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_210" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_211)" explainText="$(string.String_Explain_Specifies_the_USB_212)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_210)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_21" />
			<elements >
				<text id="Policy_Combo_Element_Configure_PCoIP_213" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.usb_auth_table" />
				<text id="Policy_Combo_Element_Configure_PCoIP_214" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.usb_unauth_table" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_TCP_215" class="Machine" displayName="$(string.String_Policy_Configure_the_TCP_216)" explainText="$(string.String_Explain_Specifies_the_TCP_217)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_TCP_215)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_23" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_TCP_218" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.tcpport" required="true" maxValue="65535" minValue="1025" />
				<decimal id="Policy_Numeric_ElementConfigure_the_TCP_219" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.tcpport_range" required="true" maxValue="64511" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_UDP_220" class="Machine" displayName="$(string.String_Policy_Configure_the_UDP_221)" explainText="$(string.String_Explain_Specifies_the_UDP_222)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_UDP_220)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_25" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_UDP_223" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.udpport" required="true" maxValue="65535" minValue="1025" />
				<decimal id="Policy_Numeric_ElementConfigure_the_UDP_224" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.udpport_range" required="true" maxValue="64511" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_225" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_226)" explainText="$(string.String_Explain_Specifies_the_virtual_227)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_225)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_27" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_PCoIP_228" valueName="pcoip.enable_vchan" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_0_Disable_virtual_229)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_2_Disable_all_230)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_3_Enable_all_231)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_PCoIP_232" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.vchan_auth_list" maxLength="255" />
				<text id="Policy_TextBox_Element_Configure_PCoIP_233" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.vchan_unauth_list" maxLength="255" />
			</elements>
		</policy>
		<policy name="Policy_Configure_clipboard_234" class="Machine" displayName="$(string.String_Policy_Configure_clipboard_235)" explainText="$(string.String_Explain_Determines_the_236)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_clipboard_234)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_29" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_clipboard_237" valueName="pcoip.server_clipboard_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Disabled_in_both_238)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_in_both_239)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_client_240)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_agent_to_241)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_clipboard_242" class="Machine" displayName="$(string.String_Policy_Configure_clipboard_243)" explainText="$(string.String_Explain_This_setting_indicates_244)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_clipboard_242)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_31" />
			<elements >
				<enum id="Policy_DropList_Clipboard_Fine_Grained_Defaults" valueName="pcoip.clipboard_fine_grained_control" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_clipboard_size_unit_kilobytes)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_clipboard_size_unit_bytes)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<decimal id="Policy_Numeric_ElementConfigure_clipboard_245" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_size" maxValue="16384" minValue="1" />
			</elements>
		</policy>
		<policy name="Policy_Filter_text_out_246" class="Machine" displayName="$(string.String_Policy_Filter_text_out_247)" explainText="$(string.String_Explain_Determines_whether_248)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_text_out_246)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_33" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_text_out_249" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Rich_Text_250" class="Machine" displayName="$(string.String_Policy_Filter_Rich_Text_251)" explainText="$(string.String_Explain_Determines_whether_252)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Rich_Text_250)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_35" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Rich_Text_253" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_rtf" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_images_out_254" class="Machine" displayName="$(string.String_Policy_Filter_images_out_255)" explainText="$(string.String_Explain_Determines_whether_256)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_images_out_254)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_37" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_images_out_257" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_image" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_258" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_259)" explainText="$(string.String_Explain_Determines_whether_260)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_258)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_39" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_261" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_msoffice_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_262" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_263)" explainText="$(string.String_Explain_Determines_whether_264)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_262)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_41" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_265" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_msoffice_chart" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_266" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_267)" explainText="$(string.String_Explain_Determines_whether_268)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_266)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_43" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_269" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_incoming_msoffice_text_effects" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_text_out_270" class="Machine" displayName="$(string.String_Policy_Filter_text_out_271)" explainText="$(string.String_Explain_Determines_whether_272)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_text_out_270)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_45" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_text_out_273" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Rich_Text_274" class="Machine" displayName="$(string.String_Policy_Filter_Rich_Text_275)" explainText="$(string.String_Explain_Determines_whether_276)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Rich_Text_274)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_47" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Rich_Text_277" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_rtf" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_images_out_278" class="Machine" displayName="$(string.String_Policy_Filter_images_out_279)" explainText="$(string.String_Explain_Determines_whether_280)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_images_out_278)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_49" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_images_out_281" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_image" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_282" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_283)" explainText="$(string.String_Explain_Determines_whether_284)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_282)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_51" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_285" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_msoffice_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_286" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_287)" explainText="$(string.String_Explain_Determines_whether_288)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_286)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_53" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_289" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_msoffice_chart" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_290" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_291)" explainText="$(string.String_Explain_Determines_whether_292)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Filter_Microsoft_290)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_55" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_293" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.clipboard_filter_outgoing_msoffice_text_effects" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_294" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_295)" explainText="$(string.String_Explain_Controls_how_PCoIP_296)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_294)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_57" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_297" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.minimum_image_quality" maxValue="100" minValue="30" />
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_298" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.maximum_initial_image_quality" maxValue="100" minValue="30" />
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_299" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.maximum_frame_rate" maxValue="120" minValue="1" />
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_300" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.use_client_img_settings" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_frame_301" class="Machine" displayName="$(string.String_Policy_Configure_frame_302)" explainText="$(string.String_Explain_Configure_the_frame_303)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_frame_301)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_59" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_frame_304" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.frame_rate_vs_quality_factor" maxValue="100" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Enable_access_to_305" class="Machine" displayName="$(string.String_Policy_Enable_access_to_306)" explainText="$(string.String_Explain_Determines_whether_307)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_console_access" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_61" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Turn_on_PCoIP_user_308" class="Machine" displayName="$(string.String_Policy_Turn_on_PCoIP_user_309)" explainText="$(string.String_Explain_Determines_whether_310)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.enable_input_language_sync" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_63" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Use_alternate_key_311" class="Machine" displayName="$(string.String_Policy_Use_alternate_key_312)" explainText="$(string.String_Explain_Specifies_an_alternate_313)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Use_alternate_key_311)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_65" />
			<elements >
				<enum id="Policy_DropList_Element_Use_alternate_key_314" valueName="pcoip.CAD_insert_substitution_scan_code" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" noSort="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Home_315)" >
						<value >
							<decimal value="327" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_End_316)" >
						<value >
							<decimal value="335" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Page_Up_317)" >
						<value >
							<decimal value="329" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Page_Down_318)" >
						<value >
							<decimal value="337" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Backspace_319)" >
						<value >
							<decimal value="14" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Tab_320)" >
						<value >
							<decimal value="15" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Print_Screen_321)" >
						<value >
							<decimal value="311" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Scroll_Lock_322)" >
						<value >
							<decimal value="70" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Right_Arrow_323)" >
						<value >
							<decimal value="333" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Left_Arrow_324)" >
						<value >
							<decimal value="331" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Down_Arrow_325)" >
						<value >
							<decimal value="336" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Up_Arrow_326)" >
						<value >
							<decimal value="328" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_327)" >
						<value >
							<decimal value="309" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_328)" >
						<value >
							<decimal value="55" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_329)" >
						<value >
							<decimal value="74" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_330)" >
						<value >
							<decimal value="78" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_Enter_331)" >
						<value >
							<decimal value="284" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_1_End_332)" >
						<value >
							<decimal value="79" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_2_Down_333)" >
						<value >
							<decimal value="80" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_3_PageDn_334)" >
						<value >
							<decimal value="81" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_4_Left_335)" >
						<value >
							<decimal value="75" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_5_336)" >
						<value >
							<decimal value="76" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_6_Right_337)" >
						<value >
							<decimal value="77" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_7_Home_338)" >
						<value >
							<decimal value="71" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_8_Up_339)" >
						<value >
							<decimal value="72" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_9_PageUp_340)" >
						<value >
							<decimal value="73" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_0_Insert_341)" >
						<value >
							<decimal value="82" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_Delete_342)" >
						<value >
							<decimal value="83" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_343)" >
						<value >
							<decimal value="12" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_344)" >
						<value >
							<decimal value="13" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_345)" >
						<value >
							<decimal value="26" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_346)" >
						<value >
							<decimal value="27" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_347)" >
						<value >
							<decimal value="43" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_348)" >
						<value >
							<decimal value="39" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_349)" >
						<value >
							<decimal value="40" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_350)" >
						<value >
							<decimal value="41" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_351)" >
						<value >
							<decimal value="51" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_352)" >
						<value >
							<decimal value="52" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_353)" >
						<value >
							<decimal value="53" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_a_A_354)" >
						<value >
							<decimal value="30" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_b_B_355)" >
						<value >
							<decimal value="48" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_c_C_356)" >
						<value >
							<decimal value="46" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_d_D_357)" >
						<value >
							<decimal value="32" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_e_E_358)" >
						<value >
							<decimal value="18" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_f_F_359)" >
						<value >
							<decimal value="33" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_g_G_360)" >
						<value >
							<decimal value="34" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_h_H_361)" >
						<value >
							<decimal value="35" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_i_I_362)" >
						<value >
							<decimal value="23" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_j_J_363)" >
						<value >
							<decimal value="36" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_k_K_364)" >
						<value >
							<decimal value="37" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_l_L_365)" >
						<value >
							<decimal value="38" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_m_M_366)" >
						<value >
							<decimal value="50" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_n_N_367)" >
						<value >
							<decimal value="49" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_o_O_368)" >
						<value >
							<decimal value="24" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_p_P_369)" >
						<value >
							<decimal value="25" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_q_Q_370)" >
						<value >
							<decimal value="16" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_r_R_371)" >
						<value >
							<decimal value="19" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_s_S_372)" >
						<value >
							<decimal value="31" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_t_T_373)" >
						<value >
							<decimal value="20" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_u_U_374)" >
						<value >
							<decimal value="22" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_v_V_375)" >
						<value >
							<decimal value="47" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_w_W_376)" >
						<value >
							<decimal value="17" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_x_X_377)" >
						<value >
							<decimal value="45" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_y_Y_378)" >
						<value >
							<decimal value="21" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_z_Z_379)" >
						<value >
							<decimal value="44" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_1_380)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_2_381)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_3_382)" >
						<value >
							<decimal value="4" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_4_383)" >
						<value >
							<decimal value="5" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_5_384)" >
						<value >
							<decimal value="6" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_6_385)" >
						<value >
							<decimal value="7" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_7_386)" >
						<value >
							<decimal value="8" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_8_387)" >
						<value >
							<decimal value="9" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_9_388)" >
						<value >
							<decimal value="10" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_0_389)" >
						<value >
							<decimal value="11" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Disable_sending_390" class="Machine" displayName="$(string.String_Policy_Disable_sending_391)" explainText="$(string.String_Explain_When_this_policy_392)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.disable_cad" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_67" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_393" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_394)" explainText="$(string.String_Explain_Configures_the_395)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_the_PCoIP_393)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_69" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_the_PCoIP_396" valueName="pcoip.transport_session_priority" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_High_Priority_397)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Medium_Priority_398)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Low_Priority_399)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Undefined_Priority_400)" >
						<value >
							<decimal value="4" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_401" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_402)" explainText="$(string.String_Explain_This_policy_enables_403)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_401)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_71" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_404" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.event_filter_mode" maxValue="3" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_405" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_406)" explainText="$(string.String_Explain_This_policy_enables_407)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_405)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_73" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_408" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.event_days_to_keep_log" maxValue="1000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_409" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_410)" explainText="$(string.String_Explain_This_policy_enables_411)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_PCoIP_409)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_75" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_412" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.event_size_to_keep_log_mb" maxValue="1000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Turn_off_Build_to_Lossles_413" class="Machine" displayName="$(string.String_Policy_Turn_off_Build_to_Lossles_414)" explainText="$(string.String_Explain_Specifies_whether_415)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_build_to_lossless" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_77" />
			<enabledValue >
				<decimal value="0" />
			</enabledValue>
			<disabledValue >
				<decimal value="1" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_maximum_416" class="Machine" displayName="$(string.String_Policy_Configure_the_maximum_417)" explainText="$(string.String_Explain_Specifies_the_maximum_418)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_maximum_416)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_79" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_maximum_419" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.max_link_rate" required="true" maxValue="900000" minValue="104" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_420" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_421)" explainText="$(string.String_Explain_Specifies_the_Maximum_422)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_PCoIP_420)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_81" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_423" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.mtu_size" required="true" maxValue="1500" minValue="500" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_424" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_425)" explainText="$(string.String_Explain_Specifies_a_lower_426)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_PCoIP_424)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_83" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_427" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.device_bandwidth_floor" required="true" maxValue="100000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Enable_disable_428" class="Machine" displayName="$(string.String_Policy_Enable_disable_429)" explainText="$(string.String_Explain_Determines_whether_430)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_audio" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_85" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Enable_disable_431" class="Machine" displayName="$(string.String_Policy_Enable_disable_432)" explainText="$(string.String_Explain_Determines_whether_433)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_micin_noise_filter" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_87" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_434" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_435)" explainText="$(string.String_Explain_Specifies_the_maximum_436)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_PCoIP_434)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_89" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_PCoIP_437" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.audio_bandwidth_limit" required="true" maxValue="100000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_connections_438" class="Machine" displayName="$(string.String_Policy_Configure_SSL_connections_439)" explainText="$(string.String_Explain_Specifies_how_SSL_440)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_SSL_connections_438)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_91" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_441" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ssl_cert_deny_legacy" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
				<enum id="Policy_DropList_Element_Configure_SSL_connections_442" valueName="pcoip.ssl_cert_type" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_a_From_the_Certificate_443)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_b_Generate_a_444)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_c_From_the_Certificate_445)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_SSL_connections_446" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.cert_store_name" maxLength="255" />
				<enum id="Policy_DropList_Element_Configure_SSL_connections_447" valueName="pcoip.ssl_cert_min_key_length" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_1024_448)" >
						<value >
							<decimal value="1024" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_2048_449)" >
						<value >
							<decimal value="2048" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_SSL_connections_4096_450)" >
						<value >
							<decimal value="4096" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_SSL_connections_451" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ca_cert_store_name" maxLength="255" />
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_452" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ask_clients_to_use_vcs_sni" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_SSL_connections_453" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ssl_disable_aes_128" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_454" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_455)" explainText="$(string.String_Explain_Controls_the_encryption_456)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_454)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_93" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_457" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_salsa20_256_round12" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_458" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_aes_128_gcm" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_459" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_aes_256_gcm" >
					<trueValue >
						<decimal value="0" />
					</trueValue>
					<falseValue >
						<decimal value="1" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_protocols_460" class="Machine" displayName="$(string.String_Policy_Configure_SSL_protocols_461)" explainText="$(string.String_Explain_Configures_openssl_462)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_SSL_protocols_460)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_95" />
			<elements >
				<text id="Policy_TextBox_Element_Configure_SSL_protocols_463" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ssl_protocol" />
			</elements>
		</policy>
		<policy name="Policy_Configure_SSL_cipher_list_461" class="Machine" displayName="$(string.String_Policy_Configure_SSL_cipher_list_463)" explainText="$(string.String_Explain_Configures_SSL_cipher_list_464)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_SSL_cipher_list_461)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_96" />
			<elements >
				<text id="Policy_TextBox_Element_Configure_SSL_cipher_list_462" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.ssl_cipher_list" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_464" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_465)" explainText="$(string.String_Explain_Specifies_the_USB_466)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_464)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_97" />
			<elements >
				<text id="Policy_Combo_Element_Configure_PCoIP_467" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.usb_auth_table" />
				<text id="Policy_Combo_Element_Configure_PCoIP_468" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.usb_unauth_table" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_TCP_469" class="Machine" displayName="$(string.String_Policy_Configure_the_TCP_470)" explainText="$(string.String_Explain_Specifies_the_TCP_471)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_TCP_469)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_99" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_TCP_472" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.tcpport" required="true" maxValue="65535" minValue="1025" />
				<decimal id="Policy_Numeric_ElementConfigure_the_TCP_473" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.tcpport_range" required="true" maxValue="64511" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_the_UDP_474" class="Machine" displayName="$(string.String_Policy_Configure_the_UDP_475)" explainText="$(string.String_Explain_Specifies_the_UDP_476)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_UDP_474)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_101" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_the_UDP_477" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.udpport" required="true" maxValue="65535" minValue="1025" />
				<decimal id="Policy_Numeric_ElementConfigure_the_UDP_478" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.udpport_range" required="true" maxValue="64511" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_479" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_480)" explainText="$(string.String_Explain_Specifies_the_virtual_481)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_479)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_103" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_PCoIP_482" valueName="pcoip.enable_vchan" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_0_Disable_virtual_483)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_2_Disable_all_484)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_PCoIP_3_Enable_all_485)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<text id="Policy_TextBox_Element_Configure_PCoIP_486" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.vchan_auth_list" maxLength="255" />
				<text id="Policy_TextBox_Element_Configure_PCoIP_487" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.vchan_unauth_list" maxLength="255" />
			</elements>
		</policy>
		<policy name="Policy_Configure_clipboard_488" class="Machine" displayName="$(string.String_Policy_Configure_clipboard_489)" explainText="$(string.String_Explain_Determines_the_490)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_clipboard_488)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_105" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_clipboard_491" valueName="pcoip.server_clipboard_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Disabled_in_both_492)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_in_both_493)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_client_494)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Enabled_agent_to_495)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_clipboard_496" class="Machine" displayName="$(string.String_Policy_Configure_clipboard_497)" explainText="$(string.String_Explain_This_setting_indicates_498)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_clipboard_496)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_107" />
			<elements >
				<enum id="Policy_DropList_Clipboard_Fine_Grained" valueName="pcoip.clipboard_fine_grained_control" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_clipboard_size_unit_kilobytes)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_clipboard_size_unit_bytes)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
				</enum>
				<decimal id="Policy_Numeric_ElementConfigure_clipboard_499" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_size" maxValue="16384" minValue="1" />
			</elements>
		</policy>
		<policy name="Policy_Filter_text_out_500" class="Machine" displayName="$(string.String_Policy_Filter_text_out_501)" explainText="$(string.String_Explain_Determines_whether_502)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_text_out_500)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_109" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_text_out_503" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Rich_Text_504" class="Machine" displayName="$(string.String_Policy_Filter_Rich_Text_505)" explainText="$(string.String_Explain_Determines_whether_506)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Rich_Text_504)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_111" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Rich_Text_507" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_rtf" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_images_out_508" class="Machine" displayName="$(string.String_Policy_Filter_images_out_509)" explainText="$(string.String_Explain_Determines_whether_510)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_images_out_508)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_113" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_images_out_511" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_image" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_512" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_513)" explainText="$(string.String_Explain_Determines_whether_514)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_512)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_115" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_515" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_msoffice_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_516" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_517)" explainText="$(string.String_Explain_Determines_whether_518)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_516)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_117" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_519" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_msoffice_chart" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_520" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_521)" explainText="$(string.String_Explain_Determines_whether_522)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_520)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_119" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_523" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_incoming_msoffice_text_effects" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_text_out_524" class="Machine" displayName="$(string.String_Policy_Filter_text_out_525)" explainText="$(string.String_Explain_Determines_whether_526)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_text_out_524)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_121" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_text_out_527" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Rich_Text_528" class="Machine" displayName="$(string.String_Policy_Filter_Rich_Text_529)" explainText="$(string.String_Explain_Determines_whether_530)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Rich_Text_528)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_123" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Rich_Text_531" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_rtf" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_images_out_532" class="Machine" displayName="$(string.String_Policy_Filter_images_out_533)" explainText="$(string.String_Explain_Determines_whether_534)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_images_out_532)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_125" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_images_out_535" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_image" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_536" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_537)" explainText="$(string.String_Explain_Determines_whether_538)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_536)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_127" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_539" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_msoffice_text" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_540" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_541)" explainText="$(string.String_Explain_Determines_whether_542)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_540)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_129" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_543" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_msoffice_chart" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Filter_Microsoft_544" class="Machine" displayName="$(string.String_Policy_Filter_Microsoft_545)" explainText="$(string.String_Explain_Determines_whether_546)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Filter_Microsoft_544)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_131" />
			<elements >
				<boolean id="Policy_CheckBox_Element_Filter_Microsoft_547" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.clipboard_filter_outgoing_msoffice_text_effects" >
					<trueValue >
						<string >1</string>
					</trueValue>
					<falseValue >
						<string >0</string>
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_548" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_549)" explainText="$(string.String_Explain_Controls_how_PCoIP_550)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_548)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_133" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_551" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.minimum_image_quality" maxValue="100" minValue="30" />
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_552" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.maximum_initial_image_quality" maxValue="100" minValue="30" />
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_553" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.maximum_frame_rate" maxValue="120" minValue="1" />
				<boolean id="Policy_CheckBox_Element_Configure_PCoIP_554" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.use_client_img_settings" >
					<trueValue >
						<decimal value="1" />
					</trueValue>
					<falseValue >
						<decimal value="0" />
					</falseValue>
				</boolean>
			</elements>
		</policy>
		<policy name="Policy_Configure_frame_555" class="Machine" displayName="$(string.String_Policy_Configure_frame_556)" explainText="$(string.String_Explain_Configure_the_frame_557)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_frame_555)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_135" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_frame_558" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.frame_rate_vs_quality_factor" maxValue="100" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Enable_access_to_559" class="Machine" displayName="$(string.String_Policy_Enable_access_to_560)" explainText="$(string.String_Explain_Determines_whether_561)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_console_access" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_137" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Turn_on_PCoIP_user_562" class="Machine" displayName="$(string.String_Policy_Turn_on_PCoIP_user_563)" explainText="$(string.String_Explain_Determines_whether_564)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.enable_input_language_sync" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_139" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Use_alternate_key_565" class="Machine" displayName="$(string.String_Policy_Use_alternate_key_566)" explainText="$(string.String_Explain_Specifies_an_alternate_567)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Use_alternate_key_565)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_141" />
			<elements >
				<enum id="Policy_DropList_Element_Use_alternate_key_568" valueName="pcoip.CAD_insert_substitution_scan_code" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" noSort="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Home_569)" >
						<value >
							<decimal value="327" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_End_570)" >
						<value >
							<decimal value="335" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Page_Up_571)" >
						<value >
							<decimal value="329" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Page_Down_572)" >
						<value >
							<decimal value="337" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Backspace_573)" >
						<value >
							<decimal value="14" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Tab_574)" >
						<value >
							<decimal value="15" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Print_Screen_575)" >
						<value >
							<decimal value="311" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Scroll_Lock_576)" >
						<value >
							<decimal value="70" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Right_Arrow_577)" >
						<value >
							<decimal value="333" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Left_Arrow_578)" >
						<value >
							<decimal value="331" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Down_Arrow_579)" >
						<value >
							<decimal value="336" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Up_Arrow_580)" >
						<value >
							<decimal value="328" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_581)" >
						<value >
							<decimal value="309" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_582)" >
						<value >
							<decimal value="55" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_583)" >
						<value >
							<decimal value="74" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_584)" >
						<value >
							<decimal value="78" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_Enter_585)" >
						<value >
							<decimal value="284" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_1_End_586)" >
						<value >
							<decimal value="79" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_2_Down_587)" >
						<value >
							<decimal value="80" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_3_PageDn_588)" >
						<value >
							<decimal value="81" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_4_Left_589)" >
						<value >
							<decimal value="75" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_5_590)" >
						<value >
							<decimal value="76" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_6_Right_591)" >
						<value >
							<decimal value="77" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_7_Home_592)" >
						<value >
							<decimal value="71" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_8_Up_593)" >
						<value >
							<decimal value="72" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_9_PageUp_594)" >
						<value >
							<decimal value="73" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_0_Insert_595)" >
						<value >
							<decimal value="82" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_Keypad_Delete_596)" >
						<value >
							<decimal value="83" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_597)" >
						<value >
							<decimal value="12" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_598)" >
						<value >
							<decimal value="13" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_599)" >
						<value >
							<decimal value="26" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_600)" >
						<value >
							<decimal value="27" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_601)" >
						<value >
							<decimal value="43" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_602)" >
						<value >
							<decimal value="39" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_603)" >
						<value >
							<decimal value="40" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_604)" >
						<value >
							<decimal value="41" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_605)" >
						<value >
							<decimal value="51" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_606)" >
						<value >
							<decimal value="52" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_607)" >
						<value >
							<decimal value="53" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_a_A_608)" >
						<value >
							<decimal value="30" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_b_B_609)" >
						<value >
							<decimal value="48" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_c_C_610)" >
						<value >
							<decimal value="46" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_d_D_611)" >
						<value >
							<decimal value="32" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_e_E_612)" >
						<value >
							<decimal value="18" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_f_F_613)" >
						<value >
							<decimal value="33" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_g_G_614)" >
						<value >
							<decimal value="34" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_h_H_615)" >
						<value >
							<decimal value="35" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_i_I_616)" >
						<value >
							<decimal value="23" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_j_J_617)" >
						<value >
							<decimal value="36" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_k_K_618)" >
						<value >
							<decimal value="37" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_l_L_619)" >
						<value >
							<decimal value="38" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_m_M_620)" >
						<value >
							<decimal value="50" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_n_N_621)" >
						<value >
							<decimal value="49" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_o_O_622)" >
						<value >
							<decimal value="24" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_p_P_623)" >
						<value >
							<decimal value="25" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_q_Q_624)" >
						<value >
							<decimal value="16" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_r_R_625)" >
						<value >
							<decimal value="19" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_s_S_626)" >
						<value >
							<decimal value="31" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_t_T_627)" >
						<value >
							<decimal value="20" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_u_U_628)" >
						<value >
							<decimal value="22" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_v_V_629)" >
						<value >
							<decimal value="47" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_w_W_630)" >
						<value >
							<decimal value="17" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_x_X_631)" >
						<value >
							<decimal value="45" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_y_Y_632)" >
						<value >
							<decimal value="21" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_z_Z_633)" >
						<value >
							<decimal value="44" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_1_634)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_2_635)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_3_636)" >
						<value >
							<decimal value="4" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_4_637)" >
						<value >
							<decimal value="5" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_5_638)" >
						<value >
							<decimal value="6" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_6_639)" >
						<value >
							<decimal value="7" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_7_640)" >
						<value >
							<decimal value="8" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_8_641)" >
						<value >
							<decimal value="9" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_9_642)" >
						<value >
							<decimal value="10" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Use_alternate_key_0_643)" >
						<value >
							<decimal value="11" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Disable_sending_644" class="Machine" displayName="$(string.String_Policy_Disable_sending_645)" explainText="$(string.String_Explain_When_this_policy_646)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.disable_cad" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_143" />
			<enabledValue >
				<decimal value="1" />
			</enabledValue>
			<disabledValue >
				<decimal value="0" />
			</disabledValue>
		</policy>
		<policy name="Policy_Configure_the_PCoIP_647" class="Machine" displayName="$(string.String_Policy_Configure_the_PCoIP_648)" explainText="$(string.String_Explain_Configures_the_649)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_the_PCoIP_647)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_145" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_the_PCoIP_650" valueName="pcoip.transport_session_priority" key="Software\Policies\Teradici\PCoIP\pcoip_admin" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_High_Priority_651)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Medium_Priority_652)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Low_Priority_653)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_the_PCoIP_Undefined_Priority_654)" >
						<value >
							<decimal value="4" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_655" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_656)" explainText="$(string.String_Explain_This_policy_enables_657)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_655)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_147" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_658" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.event_filter_mode" maxValue="3" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_659" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_660)" explainText="$(string.String_Explain_This_policy_enables_661)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_659)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_149" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_662" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.event_days_to_keep_log" maxValue="1000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_PCoIP_663" class="Machine" displayName="$(string.String_Policy_Configure_PCoIP_664)" explainText="$(string.String_Explain_This_policy_enables_665)" key="Software\Policies\Teradici\PCoIP\pcoip_admin" presentation="$(presentation.Policy_Configure_PCoIP_663)" >
			<parentCategory ref="Cat_Not_Overridable_155" />
			<supportedOn ref="SupportedOn_151" />
			<elements >
				<decimal id="Policy_Numeric_ElementConfigure_PCoIP_666" key="Software\Policies\Teradici\PCoIP\pcoip_admin" valueName="pcoip.event_size_to_keep_log_mb" maxValue="1000" minValue="0" />
			</elements>
		</policy>
		<policy name="Policy_Configure_clipboard_667" class="Machine" displayName="$(string.String_Policy_Configure_clipboard_668)" explainText="$(string.String_Explain_Determines_the_669)" presentation="$(presentation.SERVER_CLIPBOARD_AUDIT)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults">
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_29" />
			<elements>
				<enum id="SERVER_CLIPBOARD_AUDIT" valueName="pcoip.server_clipboard_audit" required="true">
					<item displayName="$(string.CLIPBOARD_AUDIT_DISABLE_BOTH)">
						<value>
							<string>0</string>
						</value>
					</item>
					<item displayName="$(string.CLIPBOARD_AUDIT_ENABLE_ONLY_SERVER_TO_CLIENT)">
						<value>
							 <string>1</string>
						</value>
					</item>
					<item displayName="$(string.CLIPBOARD_AUDIT_ENABLE_ONLY_CLIENT_TO_SERVER)">
						<value>
							<string>2</string>
						</value>
					</item>
					<item displayName="$(string.CLIPBOARD_AUDIT_ENABLE_BOTH)">
						<value>
							<string>3</string>
						</value>
					</item>
				</enum>
			</elements>
		</policy>
        <policy name="Policy_Whether_block_clipboard_673" class="Machine" displayName="$(string.String_Policy_Whether_block_clipboard_674)" explainText="$(string.String_Explain_Determines_the_675)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults"  presentation="$(presentation.Policy_Whether_block_clipboard_676)">
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_29" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_clipboard_670" valueName="pcoip.server_clipboard_allowed_by_audit" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Audit_Pass_Through_671)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_clipboard_Audit_Block_672)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_DnD_677" class="Machine" displayName="$(string.String_Policy_Configure_DnD_678)" explainText="$(string.String_Explain_Determines_the_679)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_DnD_677)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_29" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_DnD_680" valueName="pcoip.server_dnd_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
						</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_DnD_Format_State_685" class="Machine" displayName="$(string.String_Policy_Configure_DnD_Format_State_686)" explainText="$(string.String_Explain_Determines_DnD_Format_687)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_DnD_Format_688)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_29" />
			<elements >
				<enum id="Policy_DropList_Element_Configure_DnD_File_State_689" valueName="pcoip.server_dnd_file_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<enum id="Policy_DropList_Element_Configure_DnD_Text_State_690" valueName="pcoip.server_dnd_text_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<enum id="Policy_DropList_Element_Configure_DnD_RTF_State_691" valueName="pcoip.server_dnd_rtf_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<enum id="Policy_DropList_Element_Configure_DnD_Image_State_692" valueName="pcoip.server_dnd_image_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<enum id="Policy_DropList_Element_Configure_DnD_HTML_State_694" valueName="pcoip.server_dnd_html_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
				<enum id="Policy_DropList_Element_Configure_DnD_File_Content_State_695" valueName="pcoip.server_dnd_file_content_state" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Disabled_in_both_681)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_client_to_682)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_agent_to_683)" >
						<value >
							<decimal value="2" />
					</value >
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_Configure_DnD_Enabled_in_both_684)" >
						<value >
							<decimal value="3" />
						</value>
					</item>
				</enum>
			</elements>
		</policy>
		<policy name="Policy_Configure_DnD_Size_Threshold_696" class="Machine" displayName="$(string.String_Policy_Configure_DnD_Size_Threshold_697)" explainText="$(string.String_Explain_DnD_Size_Threshold_698)" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" presentation="$(presentation.Policy_Configure_DnD_Size_Threshold_699)" >
			<parentCategory ref="Cat_Overridable_Administrator_157" />
			<supportedOn ref="SupportedOn_31" />
			<elements >
				<enum id="Policy_DropList_DnD_Size_Unit" valueName="pcoip.server_dnd_size_unit" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" required="true" >
					<item displayName="$(string.String_Policy_DropList_Select_DnD_size_unit_bytes)" >
						<value >
							<decimal value="0" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_DnD_size_unit_kilobytes)" >
						<value >
							<decimal value="1" />
						</value>
					</item>
					<item displayName="$(string.String_Policy_DropList_Select_DnD_size_unit_megabytes)" >
						<value >
							<decimal value="2" />
						</value>
					</item>
				</enum>
				<decimal id="Policy_DnD_Size_Value_700" key="Software\Policies\Teradici\PCoIP\pcoip_admin_defaults" valueName="pcoip.server_dnd_size" maxValue="1023" minValue="1" />
			</elements>
		</policy>
	</policies>
</policyDefinitions>
