<?xml version="1.0" encoding="utf-8"?>
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                   xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                   revision="1.0"
                   schemaVersion="1.0"
                   xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">

  <policyNamespaces>
    <target prefix="vdm_agent_base" namespace="VMware.Policies.vdm_agent_base" />
  </policyNamespaces>

  <resources minRequiredRevision="1.0" fallbackCulture="en-us"/>
  <categories><!--Storage for Category Definitions-->
    <category name="View_Agent_Config" displayName="$(string.View_Agent_Config)" key="Software\Policies\VMware, Inc.\VMware VDM" />
  </categories>
</policyDefinitions>