<policyDefinitions revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="VMwareDEM" namespace="VMwareDEM.Policies.Root" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="Cat_VMwareDEM" displayName="$(string.Cat_VMwareDEM)" />
  </categories>
</policyDefinitions>