<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
        <string id="NAP_Category">Network Access Protection</string>
        <string id="NAP_XP_1x_QEC">Allow the Network Access Protection client to support the 802.1x Enforcement Client component</string>
        <string id="NAP_XP_1x_Help">This policy setting allows the Network Access Protection (NAP) client to support the Windows XP version of the 802.1x Enforcement Client component.

If you enable this policy setting, NAP allows the Windows XP version of the 802.1x Wireless Enforcement Client to participate. 

If you disable or do not configure this policy setting, the Windows XP version of the 802.1x Wireless Enforcement Client cannot participate in NAP. 
</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
