<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2006 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>enter display name here</displayName>
  <description>enter description here</description>
  <resources>
    <stringTable>
      <string id="PERF">Performance Control Panel</string>
      <string id="PerfCpl">Turn off access to the performance center core section</string>
      <string id="PerfCplEnabledDescription_Help">Removes access to the performance center control panel page. 

If you enable this setting, some settings within the performance control panel page will not be displayed. The administrative tools will not be affected. 

If you disable or do not configure this setting, the performance center control panel core section will be displayed to the user.</string>
      <string id="PerfSolutions">Turn off access to the solutions to performance problems section</string>
      <string id="PerfSolutionsEnabledDescription_Help">Removes access to the performance center control panel solutions to performance problems.

If you enable this setting, the solutions and issue section within the performance control panel page will not be displayed. The administrative tools will not be affected. 

If you disable or do not configure this setting, the performance center control panel solutions to performance problems section will be displayed to the user.</string>
      <string id="Upsell">Turn off access to the OEM and Microsoft branding section</string>
      <string id="UpsellEnabledDescription_Help">Removes access to the performance center control panel OEM and Microsoft branding links.

If you enable this setting, the OEM and Microsoft web links within the performance control panel page will not be displayed. The administrative tools will not be affected. 

If you disable or do not configure this setting, the performance center control panel OEM and Microsoft branding links will be displayed to the user.</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
