<?xml version="1.0" encoding="utf-8"?>
<!-- Version 6.7.2 (r42646) -->
<policyDefinitionResources revision="607.2" schemaVersion="1.0">
  <displayName>realvnc</displayName>
  <description>RealVNC root policy template</description>
  <resources>
    <stringTable>
      <string id="SUPPORTED_ProductOnly">RealVNC root policy template</string>
      <string id="RealVNC_category">RealVNC</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
