<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2011 Microsoft Corporation  -->
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">
  <displayName>Speech</displayName>
  <description>Speech platform related policies.</description>
  <resources>
    <stringTable>
      <string id="Speech_Name">Speech</string>
      <string id="AllowSpeechModelUpdate_Name">Allow Automatic Update of Speech Data</string>
      <string id="AllowSpeechModelUpdate_Explain">Specifies whether the device will receive updates to the speech recognition and speech synthesis models. 
      
A speech model contains data used by the speech engine to convert audio to text (or vice-versa). The models are periodically updated to improve accuracy and performance. Models are non-executable data files. 

If enabled (default), the device will periodically check for updated speech models and then download them from a Microsoft service using the Background Internet Transfer Service (BITS).</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
