<?xml version="1.0" encoding="utf-8"?>
<policyDefinitionResources xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                           xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                           revision="1.0"
                           schemaVersion="1.0"
                           xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions" >

  <displayName >VMware View Agent Configuration</displayName>
  <description >VMware Horizon View Agent configuration settings</description>

  <resources >
    <stringTable ><!--Storage for String Definitions-->
      <string id="View_Agent_Config" >VMware View Agent Configuration</string>
    </stringTable>
  </resources>
</policyDefinitionResources>
