<policyDefinitions revision="1.0" schemaVersion="1.0" xmlns="http://www.microsoft.com/GroupPolicy/PolicyDefinitions">
  <policyNamespaces>
    <target prefix="VMwareUEM" namespace="VMwareUEM.Policies.Root" />
  </policyNamespaces>
  <resources minRequiredRevision="1.0" />
  <categories>
    <category name="Cat_Immidio" displayName="$(string.Cat_Immidio)" />
  </categories>
</policyDefinitions>